Revit 2027 API
BuiltInFailures.WallFailures.FaceBecameVertical Property
 Face defining this non-vertical Wall is vertical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceBecameVertical { get; }
Public Shared ReadOnly Property FaceBecameVertical As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceBecameVertical {
	FailureDefinitionId^ get ();
}
static member FaceBecameVertical : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace